Repository: Dicosaedrique/activity-launcher-for-windows
Catalog: Solution/FastWorkspace.Client/AppLocales.*.resx
Languages: fr

# Components.FolderPickerInput.Error
source: You must choose a valid existing folder.
fr: Vous devez choisir un dossier valide.

# Configuration.Errors.EmptyFileStorage
source: Please choose a folder for this applications data!
fr: Veuillez choisir un dossier pour la sauvegarde des données de l'application !

# Configuration.Errors.InvalidFileStorage
source: Please choose an existing folder for this applications data!
fr: Veuillez choisir un dossier existant pour la sauvegarde des données de l'application !

# Configuration.FileStorage.FolderPicker.Label
source: Select a folder
fr: Choisir un dossier

# Configuration.FileStorage.Help
source: The application will use the provided folder to save the data (workspaces, ...)
fr: L'application utilisera le dossier selectionné pour y sauvegarder les données créées dans l'application (comme les espaces de travail)

# Configuration.FileStorage.Label
source: Application Data Folder (required)
fr: Dossier de stockage des données de l'application (requis)

# Configuration.Language.French
source: Fran√ßais
fr: Français

# Configuration.Language.Label
source: Language
fr: Langue

# Configuration.ResetButton
source: Reset
fr: Réinitialiser

# Configuration.SaveButton
source: Save
fr: Enregistrer

# Configuration.Theme.Dark
source: Dark
fr: Sombre

# Configuration.Theme.Label
source: Theme
fr: Thème

# Configuration.Theme.Light
source: Light
fr: Clair

# Configuration.Title
source: Configuration
fr: Paramètres

# Configuration.WelcomeMessage
source: Welcome to Fast Workspace! Please configure your app before seting up your workspaces.
fr: Bienvenue dans Fast Workspace ! Veuillez configurer l'application avant de pouvoir mettre en place vos espaces de travail.

# Dashboard.CreateWorkspaceButton
source: Add
fr: Ajouter

# Dashboard.Description
source: Create and edit your workspaces from this page.
fr: Créez et modifiez vos espaces de travail depuis cette page.

# Dashboard.Title
source: Workspaces
fr: Espaces de travail

# Errors.CreateWorkspace
source: An error occured while creating the workspace
fr: Une erreur est survenue lors de la création de l'espace de travail

# Errors.DeleteWorkspace
source: An error occured while deleting the workspace
fr: Une erreur est survenue lors de la suppression de l'espace de travail

# Errors.DuplicateWorkspace
source: An error occured while duplicating the workspace
fr: Une erreur est survenue lors de la duplication de l'espace de travail

# Errors.GetWorkspaces
source: An error occured while getting the workspaces
fr: Une erreur est survenue à la récupération des espaces de travail

# Errors.UpdateWorkspace
source: An error occured while updating the workspace
fr: Une erreur est survenue lors de la mise à jour de l'espace de travail

# GlobalError.Button
source: Refresh the application
fr: Recharger l'application

# GlobalError.Message
source: An unhandled error occured, please try again or
fr: Une erreur inconnue est survenue, veuillez réessayer plus tard ou

# GlobalError.Message.Link
source: signal the issue on GitHub
fr: signaler le bug sur GitHub

# GlobalError.Title
source: This application doesn't feel well...
fr: Cette application ne se sent pas bien...

# Navigation.Configuration
source: Configuration
fr: Paramètres

# Navigation.Dashboards
source: Workspaces
fr: Espaces de travail

# Notifications.CreateWorkspace
source: The workspace has been created successfully
fr: L'espace de travail a bien été créé

# Notifications.DeleteWorkspace
source: The workspace has been deleted successfully
fr: L'espace de travail a bien été supprimé

# Notifications.DuplicateWorkspace
source: The workspace has been duplicated successfully
fr: L'espace de travail a bien été dupliqué

# Notifications.UpdateWorkspace
source: The workspace has been updated successfully
fr: L'espace de travail a bien été mis à jour

# Workspace.Card.DeleteMenu
source: Delete
fr: Supprimer

# Workspace.Card.DuplicateMenu
source: Duplicate
fr: Dupliquer

# Workspace.Card.EditMenu
source: Edit
fr: Modifier

# Workspace.Dialog.CancelButton
source: Cancel
fr: Annuler

# Workspace.Dialog.Create.SubmitButton
source: Add
fr: Ajouter

# Workspace.Dialog.Create.Title
source: Create a new workspace
fr: Créer un nouvel espace de travail

# Workspace.Dialog.Delete.CancelButton
source: Cancel
fr: Annuler

# Workspace.Dialog.Delete.ConfirmButton
source: Delete
fr: Supprimer

# Workspace.Dialog.Delete.Message
source: Are you sure you want to delete workspace "{0}"? This action is final.
fr: Voulez-vous vraiment supprimer l'espace de travail "{0}" ? Cette action est définitive.

# Workspace.Dialog.Delete.Title
source: Delete workspace
fr: Supprimer l'espace de travail

# Workspace.Dialog.Edit.SubmitButton
source: Save
fr: Sauvegarder

# Workspace.Dialog.Edit.Title
source: Edit workspace
fr: Modifier l'espace de travail

# Workspace.Dialog.Name.Label
source: Name
fr: Nom

# Workspace.Dialog.Name.RequiredError
source: Workspace name is required!
fr: L'espace de travail doit avoir un nom !

# Workspace.Duplicate.Name
source: Copy of {0}
fr: Copie de {0}
