Repository: Dicosaedrique/activity-launcher-for-windows
Catalog: Solution/ActivityLauncher.Client/Locales/AboutPageLocales.*.resx
Languages: fr

# Credits.Description
source: Free open-source application, created and maintained by <a class="mud-link mud-primary-text mud-link-underline-hover" href="https://dicosaedrique.fr">Dicosaedrique (Antoine Bouabana)</a>. The source code is available on <a class="mud-link mud-primary-text mud-link-underline-hover" href="https://github.com/Dicosaedrique/activity-launcher-for-windows">GitHub (activity-launcher-for-windows)</a>. To report a bug or suggest an improvement, go to the <a class="mud-link mud-primary-text mud-link-underline-hover" href="https://github.com/Dicosaedrique/activity- launcher-for-windows/issues">GitHub Issues</a> of the project. Thank you for using this application and do not hesitate to recommend it around you if you find it useful!
fr: Application open-source, gratuite, créée et maintenue par <a class="mud-link mud-primary-text mud-link-underline-hover" href="https://dicosaedrique.fr">Dicosaedrique (Antoine Bouabana)</a>. Le code source est disponible à sur <a class="mud-link mud-primary-text mud-link-underline-hover" href="https://github.com/Dicosaedrique/activity-launcher-for-windows">GitHub (activity-launcher-for-windows)</a>. Pour signaler un bug ou suggérer une amélioration, rendez-vous dans les <a class="mud-link mud-primary-text mud-link-underline-hover" href="https://github.com/Dicosaedrique/activity-launcher-for-windows/issues">GitHub Issues</a> du projet. Merci d'utiliser cette application et n'hésitez pas à la recommender autour de vous si vous la trouvez utile !

# Credits.Title
source: Created by a dev for devs
fr: Créer par un dev pour des devs

# Description
source: Activity Launcher for Windows is the ultimate tool to optimize your computer productivity! Save valuable time by instantly launching preconfigured activities for your work, development, design, and more. Create custom task sets to streamline your workflows and quickly open essential folders, apps, and files with a single click. Whether you are a developer, a creative or simply a user wishing to optimize his time, this free and exclusive application on Windows is made for you!
fr: Activity Launcher pour Windows est l'outil ultime pour optimiser votre productivité sur ordinateur ! Gagnez un temps précieux en lançant instantanément des activités préconfigurées pour votre travail, développement, design, et bien plus encore. Créez des ensembles de tâches personnalisés pour rationaliser vos flux de travail et ouvrez rapidement des dossiers, des applications et des fichiers essentiels en un seul clic. Que vous soyez un développeur, un créatif ou simplement un utilisateur désireux d'optimiser son temps, cette application gratuite et exclusive sur Windows est faite pour vous !

# SellingPoint.1
source: <b>Create custom activities:</b> Group related tasks for specific projects and simplify your daily routine.
fr: <b>Créez des activités personnalisées :</b> Regroupez des tâches liées pour des projets spécifiques et simplifiez votre routine quotidienne.

# SellingPoint.2
source: <b>Versatile Tasks:</b> Open folders, launch apps, access workspaces in Visual Studio Code or Windows Terminal, and more.
fr: <b>Tâches polyvalentes :</b> Ouvrez des dossiers, lancez des applications, accédez à des espaces de travail dans Visual Studio Code ou Windows Terminal, et bien plus encore.

# SellingPoint.3
source: <b>Unlimited flexibility:</b> Use PowerShell to create custom scripts and perform tasks tailored to your unique needs.
fr: <b>Flexibilité sans limites :</b> Utilisez PowerShell pour créer des scripts personnalisés et exécuter des tâches adaptées à vos besoins uniques.

# SellingPoint.4
source: <b>Autostart:</b> Configure activities to run when your computer starts, providing a quick launch to your favorite work environments.
fr: <b>Démarrage automatique :</b> Configurez des activités pour s'exécuter au démarrage de votre ordinateur, offrant ainsi un lancement rapide de vos environnements de travail préférés.

# SellingPoint.5
source: <b>User friendliness first:</b> The intuitive interface makes using the app as easy as possible, even for beginners.
fr: <b>Convivialité avant tout :</b> L'interface intuitive rend l'utilisation de l'application aussi simple que possible, même pour les débutants.

# Target.1.Description
source: Developers, this application is designed especially for you! Get your projects started in a snap with pre-built activities for major development apps, like Visual Studio Code and Windows Terminal. Improve your workflow by grouping common tasks and creating custom PowerShell scripts for complex processes. Gain efficiency and spend more time creating rather than configuring.
fr: Développeurs, cette application est conçue spécialement pour vous ! Lancez vos projets en un clin d'œil avec des activités prédéfinies pour les principales applications de développement, telles que Visual Studio Code et Windows Terminal. Améliorez votre flux de travail en regroupant des tâches courantes et en créant des scripts PowerShell personnalisés pour des processus complexes. Gagnez en efficacité et consacrez plus de temps à la création plutôt qu'à la configuration.

# Target.1.Title
source: For Developers
fr: Pour les développeurs

# Target.2.Description
source: Whether you are a professional, a student or a passionate hobbyist, Activity Launcher for Windows is the perfect tool to improve your productivity. Free yourself from the tedious search for files and applications by grouping everything you need into predefined activities. Enjoy a quick and effortless launch for your daily tasks, whether for work, play or study.
fr: Que vous soyez un professionnel, un étudiant ou un amateur passionné, Activity Launcher pour Windows est l'outil idéal pour améliorer votre productivité. Libérez-vous de la recherche fastidieuse de fichiers et d'applications en regroupant tout ce dont vous avez besoin dans des activités prédéfinies. Profitez d'un lancement rapide et sans effort pour vos tâches quotidiennes, que ce soit pour le travail, les loisirs ou les études.

# Target.2.Title
source: Also for all Windows users
fr: Mais aussi pour tous les utilisateurs Windows

# Title
source: About
fr: À propos
