Repository: Dicosaedrique/activity-launcher-for-windows
Catalog: Solution/ActivityLauncher.Client/Locales/ActivityLocales.*.resx
Languages: fr

# Page.CreateActivityButton
source: Create an Activity
fr: Créer une activité

# Page.Description
source: Create and edit your activities from this page.
fr: Créez, modifiez et lancez vos activités depuis cette page.

# Page.Title
source: Activities
fr: Activités

# Notifications.Errors.CreateActivity
source: An error occurred while creating the activity
fr: Une erreur est survenue lors de la création de l'activité

# Notifications.Errors.DeleteActivity
source: An error occurred while deleting the activity
fr: Une erreur est survenue lors de la suppression de l'activité

# Notifications.Errors.DuplicateActivity
source: An error occurred while duplicating the activity
fr: Une erreur est survenue lors de la duplication de l'activité

# Notifications.Errors.GetActivities
source: An error occurred while getting the activities
fr: Une erreur est survenue à la récupération des activités

# Notifications.Errors.LaunchActivity
source: An error occurred while launching the activity
fr: Une erreur est survenue lors du lancement de l'activité

# Notifications.Errors.UpdateActivity
source: An error occurred while updating the activity
fr: Une erreur est survenue lors de la mise à jour de l'activité

# Notifications.Success.CreateActivity
source: The activity has been created successfully
fr: L'activité a bien été créé

# Notifications.Success.DeleteActivity
source: The activity has been deleted successfully
fr: L'activité a bien été supprimé

# Notifications.Success.DuplicateActivity
source: The activity has been duplicated successfully
fr: L'activité a bien été dupliqué

# Notifications.Success.LaunchActivity
source: The activity has been launched successfully
fr: L'activité a bien été lancée

# Notifications.Success.UpdateActivity
source: The activity has been updated successfully
fr: L'activité a bien été mis à jour

# Activity.Card.DeleteMenu
source: Delete
fr: Supprimer

# Activity.Card.DuplicateMenu
source: Duplicate
fr: Dupliquer

# Activity.Card.OpenScriptMenu
source: Open script
fr: Voir le script

# Activity.Dialog.CancelButton
source: Cancel
fr: Annuler

# Activity.Dialog.Create.SubmitButton
source: Create
fr: Créer

# Activity.Dialog.Create.Title
source: Create a New Activity
fr: Créer une nouvelle activité

# Activity.Dialog.Delete.CancelButton
source: Cancel
fr: Annuler

# Activity.Dialog.Delete.ConfirmButton
source: Delete
fr: Supprimer

# Activity.Dialog.Delete.Message
source: Are you sure you want to delete activity "{0}"? This action is final.
fr: Voulez-vous vraiment supprimer l'activité "{0}" ? Cette action est définitive.

# Activity.Dialog.Delete.Title
source: Delete Activity
fr: Supprimer l'activité

# Activity.Dialog.Description.Label
source: Activity Description
fr: Description de l'activité

# Activity.Dialog.Edit.SubmitButton
source: Save
fr: Sauvegarder

# Activity.Dialog.Edit.Title
source: Edit Activity
fr: Modifier l'activité

# Activity.Dialog.Name.Label
source: Activity Name
fr: Nom de l'activité

# Activity.Dialog.Name.RequiredError
source: Activity name is required!
fr: L'activité doit avoir un nom !

# Activity.Duplicate.Name
source: Copy of "{0}"
fr: Copie de "{0}"

# Activity.Dialog.Script.LaunchButton
source: Run script
fr: Exécuter le script

# Activity.Dialog.Script.Highlight.Label
source: Highlight script syntax
fr: Mettre en surbrillance la syntaxe

# Activity.Dialog.Script.StartChevron.Label
source: Add chevrons on line start
fr: Ajouter les chevrons en début de ligne

# Activity.Dialog.Script.Title
source: PowerShell Script for Activity "{0}"
fr: Script PowerShell de l'activité "{0}"

# Activity.Dialog.Launch.CancelButton
source: Cancel
fr: Annuler

# Activity.Dialog.Launch.ConfirmButton
source: Run
fr: Exécuter

# Activity.Dialog.Launch.Message
source: Are you sure you want to run the generated PowerShell script? No automatic verification has been performed, so we recommend that you manually review the script before executing it, to ensure that no problems occur at runtime.
fr: Êtes-vous sûr de vouloir exécuter le script PowerShell généré ? Aucune vérification automatique n'a été faite, il est donc recommandé de faire une revue manuelle du script avant son exécution afin de s'assurer qu'aucun problème ne puisse survenir à l'exécution.

# Activity.Dialog.Launch.ReviewScript
source: Review Script
fr: Vérifier le script

# Activity.Dialog.Launch.Title
source: Run Script for Activity "{0}"
fr: Lancer le script pour l'activité "{0}"

# Activity.Card.EditButtonTooltip
source: Edit activity
fr: Modifier l'activité

# Activity.Dialog.View.Description.Title
source: Activity Description
fr: Description de l'activité

# Activity.Dialog.Tasks.AddTask
source: Add task
fr: Ajouter une tâche

# Activity.Dialog.View.Description.Empty
source: No description
fr: Aucune description

# Activity.Dialog.Tasks.Empty
source: There is no tasks in this activity.
fr: Il n'y a aucune tâche dans cette activité.

# Activity.Dialog.Tasks.Title
source: Tasks
fr: Tâches

# Notifications.Errors.LaunchTask
source: An error occurred while launching the task
fr: Une erreur est survenue lors du lancement de la tâche

# Notifications.Success.LaunchTask
source: The task has been launched successfully
fr: La tâche a bien été lancée

# Task.Dialog.Launch.CancelButton
source: Cancel
fr: Annuler

# Task.Dialog.Launch.ConfirmButton
source: Run
fr: Exéctuer

# Task.Dialog.Launch.Message
source: Are you sure you want to run the generated PowerShell script? No automatic verification has been performed, so we recommend that you manually review the script before executing it, to ensure that no problems occur at runtime.
fr: Êtes-vous sûr de vouloir exécuter le script PowerShell généré ? Aucune vérification automatique n'a été faite, il est donc recommandé de faire une revue manuelle du script avant son exécution afin de s'assurer qu'aucun problème ne puisse survenir à l'exécution.

# Task.Dialog.Launch.Title
source: Launch task "{0}"
fr: Lancer la tâche "{0}"

# Task.EmptyName
source: No Name
fr: Sans nom

# Task.Dialog.ExplorerFolderTask.HelperTooltip
source: This task allows you to open the explorer at any folder location that you want.
fr: Cette tâche vous permet d'ouvrir l'explorateur de fichier où vous le souhaitez.

# Task.ExplorerFolderTask.Title
source: File Explorer
fr: Explorateur de fichier

# Task.Dialog.OpenFileTask.HelperTooltip
source: This task allows you to open any file with its default application (if any).
fr: Cette tâche vous permet d'ouvrir n'importe quel fichier avec son application par défaut (s'il y en a une).

# Task.OpenFileTask.Title
source: Open file
fr: Ouverture fichier

# Task.Dialog.ProgramTask.HelperTooltip
source: This task allows you to open any program by either specifying its name or by specifying the program file location. Some program can be launched with their name but some needs to specify a certain program file location and some additionnal argument that you can add if needed.
fr: Cette tâche vous permet d'ouvrir n'importe quel programme en spécifiant son nom ou en spécifiant l'emplacement du fichier exécutable. Certains programmes peuvent être lancés avec leur nom mais certains nécessitent de spécifier un certain emplacement de fichier exécutable et des arguments supplémentaires que vous pouvez ajouter si nécessaire.

# Task.ProgramTask.Title
source: Open a program
fr: Ouvrir un programme

# Task.Dialog.ScriptTask.HelperTooltip
source: This task allows you to add any PowerShell script that you want.
fr: Cette tâche vous permet d'ajouter n'importe quel script PowerShell que vous souhaitez.

# Task.ScriptTask.Title
source: PowerShell Script
fr: Script PowerShell

# Task.Dialog.TerminalTask.HelperTooltip
source: This tasks allows you to open one or more tab in Windows Terminal. For each tab you can choose the title and the color of the tabs, the default location and the default command to execute in the tab. All the parameters are optionnal if you just wanna open an empty tab.
fr: Cette tâche vous permet d'ouvrir un ou plusieurs onglets dans Windows Terminal. Pour chaque onglet, vous pouvez choisir le titre et la couleur de l'onglet, l'emplacement par défaut et la commande par défaut à exécuter dans l'onglet. Tous les paramètres sont facultatifs si vous souhaitez simplement ouvrir un onglet vide.

# Task.Dialog.VSCodeTask.HelperTooltip
source: This task allows you to open a workspace directory in Visual Studio Code.
fr: Cette tâche vous permet d'ouvrir un répertoire d'espace de travail dans Visual Studio Code.

# Task.NewName
source: New Task {0}
fr: Nouvelle tâche {0}

# Task.Dialog.Name.Label
source: Task name
fr: Nom de la tâche

# Task.Dialog.Name.RequiredError
source: Task name is required!
fr: La tâche doit avoir un nom !

# Activity.Card.LaunchActivityTooltip
source: Launch activity
fr: Lancer l'activité

# Task.Dialog.DeleteHelper
source: Delete task
fr: Supprimer la tâche

# Task.Dialog.LaunchHelper
source: Launch task
fr: Lancer la tâche

# Activity.Dialog.View.CreationDate
source: Created {0}
fr: Créée {0}

# Activity.Dialog.View.EditButton
source: Edit
fr: Modifier

# Activity.Dialog.View.LastModifiedDate
source: Last modified {0}
fr: Modifiée {0}

# Task.Dialog.ExplorerFolderTask.DirectoryPath.Empty
source: No folder entered.
fr: Aucun dossier renseigné.

# Task.Dialog.ExplorerFolderTask.DirectoryPath.Label
source: Folder to open
fr: Dossier à ouvrir

# Task.Dialog.OpenFileTask.FilePath.Empty
source: No file entered.
fr: Aucun fichier renseigné.

# Task.Dialog.OpenFileTask.FilePath.Label
source: File to open
fr: Fichier à ouvrir

# Task.Dialog.ScriptTask.Script.Empty
source: No script entered.
fr: Aucun script renseigné.

# Task.Dialog.ScriptTask.Script.Label
source: PowerShell Script
fr: Script PowerShell

# Task.Dialog.VSCodeTask.DirectoryPath.Empty
source: No workspace entered.
fr: Aucun espace de travail renseigné.

# Task.Dialog.VSCodeTask.DirectoryPath.Label
source: Workspace folder
fr: Dossier de l'espace de travail

# Activity.Dialog.Tasks.NavList.AllTasks
source: All
fr: Toutes

# Activity.Dialog.Tasks.NavList.TasksLabel
source: Tasks
fr: Tâches

# Activity.Dialog.Tasks.NavList.Title
source: Tasks Selection
fr: Selection tâches

# Task.Dialog.TerminalTask.AddTerminalTabButton
source: Add terminal tab
fr: Ajouter un onglet de terminal

# Task.Dialog.TerminalTask.DefaultTabTitle
source: Tab {0}
fr: Onglet {0}

# Task.Dialog.TerminalTask.TerminalTab.Color.Empty
source: No tab color entered
fr: Aucune couleur d'onglet renseignée

# Task.Dialog.TerminalTask.TerminalTab.Color.Label
source: Tab color
fr: Couleur de l'onglet

# Task.Dialog.TerminalTask.TerminalTab.Command.Empty
source: No initial command entered
fr: Aucune commande initiale renseignée

# Task.Dialog.TerminalTask.TerminalTab.Command.Label
source: Initial command
fr: Commande initiale

# Task.Dialog.TerminalTask.TerminalTab.LocationPath.Empty
source: No working directory entered
fr: Aucun repertoire de travail renseigné

# Task.Dialog.TerminalTask.TerminalTab.LocationPath.Label
source: Working directory
fr: Repertoire de travail

# Task.Dialog.TerminalTask.TerminalTab.Title.Label
source: Tab title
fr: Titre de l'onglet

# Task.Dialog.TerminalTask.TerminalTabs.Empty
source: No tabs has been added.
fr: Aucun onglet n'a été ajouté.

# Activity.Card.InvalidTooltip
source: The activity cannot be launched because {0} tasks are invalid
fr: L'activité ne peut pas être lancée car {0} tâches sont invalides

# Activity.Card.InvalidTooltip_one
source: The activity cannot be launched because a task is invalid
fr: L'activité ne peut pas être lancée car une tâche est invalide

# Task.Dialog.ExplorerFolderTask.InvalidTooltip
source: Invalid task, you must specify a valid and existing folder location
fr: Tâche invalide, vous devez spécifier un emplacement de dossier valide et existant

# Task.Dialog.OpenFileTask.InvalidTooltip
source: Invalid task, you must specify a valid and existing file location
fr: Tâche invalide, vous devez spécifier un emplacement de fichier valide et existant

# Task.Dialog.ProgramTask.InvalidTooltip
source: Invalid task, you must specify a valid and existing program name or executable location
fr: Tâche invalide, vous devez spécifier un nom de programme ou un emplacement d'exécutable valide et existant

# Task.Dialog.ScriptTask.InvalidTooltip
source: Invalid task
fr: Tâche invalide

# Task.Dialog.TerminalTask.InvalidTooltip
source: One or more terminal tabs contain invalid settings
fr: Un ou plusieurs onglet de terminal contiennent des paramètres invalides

# Task.Dialog.VSCodeTask.InvalidTooltip
source: Invalid task, you must specify a valid and existing folder location
fr: Tâche invalide, vous devez spécifier un emplacement de dossier valide et existant

# Task.Dialog.ProgramTask.ArgumentList.Label
source: Run Parameters (-ArgumentList)
fr: Paramètres d'exécution (-ArgumentList)

# Task.Dialog.ProgramTask.ProgramFilePath.Label
source: Program executable file
fr: Fichier exécutable du programme

# Task.Dialog.ProgramTask.ProgramName.Label
source: Program name
fr: Nom du programme
